// dz1.5.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");
    bool day, curtains_open, lamp_on;
    cout << "Вводите 1 для ответа \"да\" и 0 для ответа \"нет\"" << endl;

    cout << "Сейчас день?" << endl;
    cin >> day;

    cout << "Шторы открыты?" << endl;
    cin >> curtains_open;

    cout << "Лампа включена?" << endl;
    cin >> lamp_on;

    if (day && curtains_open || lamp_on)
        cout << "В комнате светло" << endl;
    else
        cout << "В комнате темно" << endl;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
