// dz2.1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <cmath>
#define PI acos(-1)

using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");
    double R, r, h, l;

    cout << "Введите радиус нижнего основания: ";
    cin >> R;
    
    cout << "Введите радиус верхнего основания: ";
    cin >> r;
    
    cout << "Введите высоту конуса: ";
    cin >> h;

    l = hypot(R - r, h);

    cout << "Объем усеченного конуса: " << (1.0 / 3.0) * PI * h * (pow(R, 2) + R * r + pow(r, 2)) << endl
        << "Площадь полной поверхности: " << PI * (pow(R, 2) + (R + r) * l + pow(r, 2));
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
